BBTree-main/fio_test.log
Appendtest: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=spdk, iodepth=1
fio-3.38-5-g86fc
Starting 1 thread


Run status group 0 (all jobs):
Appendtest: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=spdk, iodepth=1
fio-3.38-5-g86fc
Starting 1 thread

Appendtest: (groupid=0, jobs=1): err= 0: pid=2030519: Mon Oct 28 01:29:31 2024
  write: IOPS=77.5k, BW=303MiB/s (318MB/s)(35.5GiB/120001msec); 32 zone resets
    slat (nsec): min=112, max=16204, avg=269.39, stdev=149.85
    clat (nsec): min=10394, max=395406, avg=12120.13, stdev=737.48
     lat (nsec): min=10531, max=395541, avg=12389.52, stdev=763.55
    clat percentiles (nsec):
     |  1.00th=[11072],  5.00th=[11200], 10.00th=[11328], 20.00th=[11584],
     | 30.00th=[11712], 40.00th=[11840], 50.00th=[12096], 60.00th=[12224],
     | 70.00th=[12480], 80.00th=[12608], 90.00th=[12864], 95.00th=[13120],
     | 99.00th=[13888], 99.50th=[15040], 99.90th=[19328], 99.95th=[21376],
     | 99.99th=[22912]
   bw (  KiB/s): min=297016, max=330424, per=100.00%, avg=310255.50, stdev=10344.33, samples=239
   iops        : min=74254, max=82606, avg=77563.87, stdev=2586.08, samples=239
  lat (usec)   : 20=99.92%, 50=0.08%, 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=100.00%, sys=0.00%, ctx=165, majf=0, minf=299
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,9305011,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=303MiB/s (318MB/s), 303MiB/s-303MiB/s (318MB/s-318MB/s), io=35.5GiB (38.1GB), run=120001-120001msec
Appendtest: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=spdk, iodepth=8
fio-3.38-5-g86fc
Starting 1 thread

Appendtest: (groupid=0, jobs=1): err= 0: pid=2032640: Mon Oct 28 01:38:59 2024
  write: IOPS=176k, BW=688MiB/s (721MB/s)(80.6GiB/120001msec); 77 zone resets
    slat (nsec): min=110, max=41058, avg=226.74, stdev=116.25
    clat (usec): min=11, max=1441, avg=44.82, stdev=18.10
     lat (usec): min=11, max=1441, avg=45.05, stdev=18.10
    clat percentiles (usec):
     |  1.00th=[   18],  5.00th=[   21], 10.00th=[   24], 20.00th=[   28],
     | 30.00th=[   34], 40.00th=[   38], 50.00th=[   43], 60.00th=[   48],
     | 70.00th=[   53], 80.00th=[   60], 90.00th=[   70], 95.00th=[   78],
     | 99.00th=[   96], 99.50th=[  102], 99.90th=[  118], 99.95th=[  124],
     | 99.99th=[  137]
   bw (  KiB/s): min=695752, max=710912, per=100.00%, avg=704350.79, stdev=2447.41, samples=239
   iops        : min=173938, max=177728, avg=176087.70, stdev=611.85, samples=239
  lat (usec)   : 20=3.86%, 50=60.51%, 100=35.00%, 250=0.63%, 500=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=100.00%, sys=0.00%, ctx=211, majf=0, minf=309
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,21128068,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=688MiB/s (721MB/s), 688MiB/s-688MiB/s (721MB/s-721MB/s), io=80.6GiB (86.5GB), run=120001-120001msec
Appendtest: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=spdk, iodepth=8
fio-3.38-5-g86fc
Starting 1 thread

Appendtest: (groupid=0, jobs=1): err= 0: pid=2033412: Mon Oct 28 01:40:33 2024
  write: IOPS=176k, BW=688MiB/s (721MB/s)(40.3GiB/60001msec); 37 zone resets
    slat (nsec): min=110, max=53499, avg=226.70, stdev=117.23
    clat (usec): min=10, max=1408, avg=44.83, stdev=18.17
     lat (usec): min=11, max=1408, avg=45.06, stdev=18.17
    clat percentiles (usec):
     |  1.00th=[   18],  5.00th=[   21], 10.00th=[   24], 20.00th=[   28],
     | 30.00th=[   34], 40.00th=[   38], 50.00th=[   43], 60.00th=[   48],
     | 70.00th=[   53], 80.00th=[   60], 90.00th=[   70], 95.00th=[   78],
     | 99.00th=[   96], 99.50th=[  102], 99.90th=[  118], 99.95th=[  124],
     | 99.99th=[  137]
   bw (  KiB/s): min=690464, max=710624, per=100.00%, avg=704082.33, stdev=2845.75, samples=120
   iops        : min=172616, max=177656, avg=176020.57, stdev=711.33, samples=120
  lat (usec)   : 20=3.87%, 50=60.49%, 100=35.01%, 250=0.63%, 500=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=100.00%, sys=0.00%, ctx=86, majf=0, minf=239
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,10561238,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=688MiB/s (721MB/s), 688MiB/s-688MiB/s (721MB/s-721MB/s), io=40.3GiB (43.3GB), run=60001-60001msec
Appendtest: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=8
fio-3.38-5-g86fc
Starting 1 thread


Run status group 0 (all jobs):
Appendtest: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=8
fio-3.38-5-g86fc
Starting 1 thread


Run status group 0 (all jobs):
Appendtest: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=8
fio-3.38-5-g86fc
Starting 1 thread


Run status group 0 (all jobs):
Appendtest: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=4
fio-3.38-5-g86fc
Starting 1 thread


Run status group 0 (all jobs):
Appendtest: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=spdk, iodepth=4
fio-3.38-5-g86fc
Starting 1 thread

Appendtest: (groupid=0, jobs=1): err= 0: pid=2041508: Mon Oct 28 02:13:42 2024
  write: IOPS=201k, BW=784MiB/s (822MB/s)(45.9GiB/60001msec); 42 zone resets
    slat (nsec): min=112, max=27023, avg=227.02, stdev=116.10
    clat (usec): min=10, max=1363, avg=19.32, stdev= 4.36
     lat (usec): min=10, max=1363, avg=19.54, stdev= 4.36
    clat percentiles (nsec):
     |  1.00th=[12096],  5.00th=[12992], 10.00th=[13888], 20.00th=[15168],
     | 30.00th=[16512], 40.00th=[17792], 50.00th=[19072], 60.00th=[20096],
     | 70.00th=[21632], 80.00th=[23168], 90.00th=[25216], 95.00th=[26752],
     | 99.00th=[29568], 99.50th=[30848], 99.90th=[33536], 99.95th=[34560],
     | 99.99th=[36608]
   bw (  KiB/s): min=791176, max=803568, per=100.00%, avg=802909.80, stdev=1140.56, samples=120
   iops        : min=197794, max=200892, avg=200727.43, stdev=285.13, samples=120
  lat (usec)   : 20=58.31%, 50=41.69%, 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=100.00%, sys=0.00%, ctx=111, majf=0, minf=232
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,12043647,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=784MiB/s (822MB/s), 784MiB/s-784MiB/s (822MB/s-822MB/s), io=45.9GiB (49.3GB), run=60001-60001msec